# DataFrame

- 2차원 배열
- 행과 열로 구성

In [121]:
import pandas as pd

In [122]:
# Dictionary를 이용한 DataFrame 생성
dict_data = {"c0":[1,2,3], "c1":[4,5,6], "c2":[7,8,9], "c3": [10, 11, 12], "c4":[13,14,15]}
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [123]:
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [124]:
# List를 이용한 DataFrame 생성
df = pd.DataFrame([[15, "남", "덕영중"], [17, "여", "수리중"]], index=["준서", "예은"], columns=["나이", "성별", "학교"])
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [125]:
# 행과 열 이름 변경하기
print(df.index)
print(df.columns)

Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

In [126]:
# 행 인덱스, 열 이름 변경하기 - 1
df.index = ["학생1", "학생2"]
df.columns = ["연령", "남녀", "소속"]
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [127]:
# List를 이용한 DataFrame 생성
df = pd.DataFrame([[15, "남", "덕영중"], [17, "여", "수리중"]], index=["준서", "예은"], columns=["나이", "성별", "학교"])
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [128]:
df.rename(columns={"나이":"연령", "성별":"남녀", "학교":"소속"}, inplace=True)
df

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [129]:
# 행 이름 변경하기
# df의 행 인덱스 중에서 준서를 학생1로 예은을 학생2로 바꾸기
df.rename(index={"준서":"학생1", "예은":"학생2"}, inplace=True)
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [130]:
# Dictionary를 이용한 DataFrame 생성
df = pd.DataFrame({"수학":[90,80,70], "영어":[98,89,95], "음악":[85,95,100], "체육": [100,90,90]},
                   index=["서준", "우현", "인아"])
print(df)

# List를 이용한 DataFrame 생성
df = pd.DataFrame([[90, 98, 85, 100], [80, 89, 95, 90], [70, 95, 100, 90]],
               index=["서준", "우현", "인아"], columns=["수학", "영어", "음악", "체육"])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

## 행 삭제

In [131]:
df2 = df.copy()

In [132]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [133]:
# df2의 index가 우현인 1개행을 삭제
df2.drop("우현", axis = 0, inplace=True)

In [134]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [135]:
df3 = df.copy()

In [136]:
df3

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [137]:
# df3의 index가 우현과 인아 인 2개행을 삭제
df3.drop(["우현", "인아"], axis=0, inplace=True)

In [138]:
df3

    수학  영어  음악   체육
서준  90  98  85  100

In [139]:
# 열 삭제
df4 = df.copy()

In [140]:
df4

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [141]:
# df4의 수학 1개 열을 삭제
df4.drop("수학", axis=1, inplace=True)
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [142]:
# df5의 영어와ㅣ 음악 2개열을 삭제
df5 = df.copy()
print(df5)
df5.drop(["영어", "음악"], axis=1, inplace=True)
df5

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [143]:
# indedx가 서ㄴㅣㄴ 행ㅡ 선ㅐ
print(df.loc["서준"])
print(df.iloc[0])

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64
수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [144]:
# 행 인덱스를 사용하여 서준과 우현 2개의 행을 선택
df.loc[["서준","우현"]]
df.iloc[:2]

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

# 열 선택

In [145]:
df.수학
df["수학"]

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

### 범위 Slicing 활용
- dataFrame.iloc[시작index:끝index:증가치]

In [146]:
# 처음부터 끝까지 2씩 index를 증가시켜서 보여주기
df.iloc[::2]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [147]:
# 0번부터 2번까지 2씩 증가시켜서 보여주기
df.iloc[0:3:2]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [148]:
# 처음부터 끝까지 -1씩 증가시켜서 보여주기 --> 순서 반전
df.iloc[::-1]

    수학  영어   음악   체육
인아  70  95  100   90
우현  80  89   95   90
서준  90  98   85  100

# 행과 열을 이용한 데이터 선택

In [149]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [150]:
# Dictionary를 이용한 DataFrame 생성
df = pd.DataFrame({"수학":[90,80,70], "영어":[98,89,95], "음악":[85,95,100], "체육": [100,90,90],
                  "이름" : ["서준", "우현", "인아"]})
df

   수학  영어   음악   체육  이름
0  90  98   85  100  서준
1  80  89   95   90  우현
2  70  95  100   90  인아

In [151]:
# index 만들기
df.set_index("이름", inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [152]:
# 방법이 다양해서 이것저것 다 이해하기!
print(df.loc["서준",["음악", "체육"]])
print(df.iloc[0,2:4])
print(df.loc["서준","음악":"체육"])
print(df.loc["서준","음악":])

음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64

In [153]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [154]:
# column 추가하기
df["국어"] = 80
# df["국어"] = [10, 20, 30]
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [155]:
# row 추가하기
# df.loc["철수"] = 0
df.loc["철수"] = [10, 20, 30, 40, 50]
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80
철수  10  20   30   40  50

In [156]:
# 같은 데이터 복제? 같은 느낌
df.loc["영희"] = df.loc["인아"]
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80
철수  10  20   30   40  50
영희  70  95  100   90  80

In [157]:
# 서준의 체육 점수를 80점으로 변경하기
df.loc["서준","체육"] = 80
# df.iloc[0, 3] = 80
df

    수학  영어   음악  체육  국어
이름
서준  90  98   85  80  80
우현  80  89   95  90  80
인아  70  95  100  90  80
철수  10  20   30  40  50
영희  70  95  100  90  80

In [158]:
# 서준의 음악과 체육 점수를 50점으로 변경하기
df.loc["서준",["음악","체육"]] = 50
# df.iloc[0, 2:4] = 50
df

    수학  영어   음악  체육  국어
이름
서준  90  98   50  50  80
우현  80  89   95  90  80
인아  70  95  100  90  80
철수  10  20   30  40  50
영희  70  95  100  90  80

In [159]:
# 서준의 음악 점수를 100점 체육점수를 50점으로 변경하기
# df.loc["서준","음악"], df.loc["서준","체육"] = (100, 50)
# df.loc["서준",["음악","체육"]] = [100, 50]
df.loc["서준",["음악","체육"]] = 100, 50
df

    수학  영어   음악  체육  국어
이름
서준  90  98  100  50  80
우현  80  89   95  90  80
인아  70  95  100  90  80
철수  10  20   30  40  50
영희  70  95  100  90  80

In [160]:
# 행과 열의 위치 바꾸기
df

    수학  영어   음악  체육  국어
이름
서준  90  98  100  50  80
우현  80  89   95  90  80
인아  70  95  100  90  80
철수  10  20   30  40  50
영희  70  95  100  90  80

In [161]:
df.transpose()

이름   서준  우현   인아  철수   영희
수학   90  80   70  10   70
영어   98  89   95  20   95
음악  100  95  100  30  100
체육   50  90   90  40   90
국어   80  80   80  50   80

In [162]:
df.T

이름   서준  우현   인아  철수   영희
수학   90  80   70  10   70
영어   98  89   95  20   95
음악  100  95  100  30  100
체육   50  90   90  40   90
국어   80  80   80  50   80

In [163]:
# df 만들기!
df = pd.DataFrame({"c0":[1,2,3], "c1": [4,5,6], "c2": [7,8,9], "c3":[10, 11, 12], "c4":[13, 14, 15]},
 index=["r0", "r1", "r2"])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [164]:
# 인덱스를 재설정하기
new_index = ["r0", "r1", "r2", "r3", "r4"]
ndf = df.reindex(new_index, fill_value=0)
ndf

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [165]:
# index 리셋시키기
ndf = df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [166]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [167]:
# 내림차순으로 행 인덱스 정렬
df.sort_index(ascending=False)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [168]:
# 특정 값을 기준으로 정렬
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [169]:
df.sort_values(by="c1", ascending=False, inplace=True)
df

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

### DataFrame 연산

In [170]:
import seaborn as sns

In [171]:
titanic = sns.load_dataset("titanic")

In [172]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [173]:
# 기존 column 으로 새로운 column을 유추해 내는 것이 특성공학(column Engineering)

In [174]:
# titanic에서 age와 fare부분의 컬럼만 발췌하여 df라는 dataFrame 만들기
df = titanic[["age", "fare"]]
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [175]:
# 여러 속성 보기
df.describe()

              age        fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [176]:
# 모든 컬럼을 10씩 증가하며 addition이라는 dataframe 생성하기
addition = df + 10
addition

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [177]:
# addtion과 df의 차를 구해서 subtraction이라는 dataframe 만들기
subtraction = addition - df
subtraction

      age  fare
0    10.0  10.0
1    10.0  10.0
2    10.0  10.0
3    10.0  10.0
4    10.0  10.0
..    ...   ...
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0

[891 rows x 2 columns]